{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b0eda422",
   "metadata": {},
   "source": [
    "# B. Задача трека \"Бэкенд\" - Шашки\n",
    "* Ограничение времени\t1 секунда\n",
    "* Ограничение памяти\t256.0 Мб\n",
    "* Ввод\tстандартный ввод или input.txt\n",
    "* Вывод\tстандартный вывод или output.txt\n",
    "\n",
    "Разработчики любят проводить свободное время за настольными играми. Иногда это шахматы, иногда — UNO, а иногда — шашки. Однако, когда неопытные игроки садятся за шашки, они периодически допускают ошибки (прямо как в программировании!) и не рубят шашку соперника, когда такая возможность есть.\n",
    "\n",
    "Чтобы избежать ошибок, разработчики решили написать программу, которая будет по текущей позиции определять, можно ли сходить так, чтобы срубить шашку противника. Но прямо сейчас у них много других важных проектов, поэтому запрограммировать анализатор позиции попросили вас.\n",
    "\n",
    "Для тех, кто давненько не брал в руки шашек, напомним правила:\n",
    "\n",
    "все шашки стоят на полях одного цвета;\n",
    "одна шашка может срубить другую, если та стоит на соседней клетке по диагонали и при этом в следующей диагональной клетке в направлении соперника нет никакой другой шашки.\n",
    "\n",
    "## Формат ввода\n",
    "В первой строке даны числа \n",
    "N и \n",
    "M (\n",
    "$ 1 \\le N $\n",
    ",\n",
    "$ M \\le 10^{-3} $) — размеры доски, на которой разработчики играют в шашки. Каждое поле имеет свой цвет: черный или белый. При этом гарантируется, что поле с координатами \n",
    "(1;1) имеет черный цвет. Гарантируется также, что поле, имеющее общую границу с черным полем, будет иметь белый цвет, а поле, имеющее общую границу с белым полем, — черный цвет.\n",
    "\n",
    "В следующей строке дано число \n",
    "w — количество белых шашек на поле. В следующих\n",
    "w строках задаются два целых числа \n",
    "i и \n",
    "j (1 ≤ i ≤ N,1 ≤ j ≤ M) — поля, на которых стоят белые шашки. \n",
    "\n",
    "В следующей строке дано число \n",
    "b — количество черных шашек на поле. В следующих \n",
    "b строках задаются поля с черными шашками, точно так же, как и с белыми. \n",
    "\n",
    "Гарантируется, что количество шашек каждого цвета — целое положительное число, и что \n",
    "2 ≤ w+b ≤ (NM+1)/2. \n",
    "\n",
    "Гарантируется, что все шашки стоят на черных полях.\n",
    "\n",
    "В заключительной строке ввода указано, чей ход: \"white\", если белых, и \"black\" — если черных.\n",
    "\n",
    "## Формат вывода\n",
    "В единственной строке выведите \"Yes\", если автор хода может срубить шашку соперника, и \"No\" в противоположном случае."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe7b3eef",
   "metadata": {},
   "source": [
    "## мы не будем проверять гарантированные вещи:\n",
    "* корректность разметки поля по цветам, где (1,1) всегда черное\n",
    "* количество шашек каждого цвета — целое положительное число\n",
    "* все шашки стоят на черных полях\n",
    "* 2 ≤ w+b ≤ (NM+1)/2 (полей для шашек больше чем шашек)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "aff82a50",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "No\n"
     ]
    }
   ],
   "source": [
    "# reading input\n",
    "tmp_str = input()\n",
    "N = int(tmp_str.split()[0])\n",
    "M = int(tmp_str.split()[1])\n",
    "\n",
    "w = int(input())\n",
    "whites = []\n",
    "for i in range(w):\n",
    "    tmp_str = input()\n",
    "    n = int(tmp_str.split()[0])\n",
    "    m = int(tmp_str.split()[1])\n",
    "    whites.append((n,m))\n",
    "\n",
    "b = int(input())\n",
    "blacks = []\n",
    "for i in range(b):\n",
    "    tmp_str = input()\n",
    "    n = int(tmp_str.split()[0])\n",
    "    m = int(tmp_str.split()[1])\n",
    "    blacks.append((n,m))\n",
    "\n",
    "turn = input()\n",
    "\n",
    "# ---- end reading input\n",
    "# setting our side:\n",
    "if turn == 'white':\n",
    "    me = whites\n",
    "    him = blacks\n",
    "elif turn == 'black':\n",
    "    me = blacks\n",
    "    him = whites\n",
    "else:\n",
    "    print('whose turn is not clear !')\n",
    "\n",
    "# defining useful check functions\n",
    "\n",
    "def check_kill_zone(nm,x,y):\n",
    "    '''\n",
    "    this functions checks if there is opponent figure in the direction of x,y from cell nm\n",
    "    RETURNS: True if condition is met\n",
    "    '''    \n",
    "    if not 1 <= nm[0]+x <= N:\n",
    "        return False\n",
    "    if not 1 <= nm[1]+y <= M:\n",
    "        return False\n",
    "    \n",
    "    if (nm[0]+x,nm[1]+y) in him:\n",
    "        return True\n",
    "    else:\n",
    "        return False\n",
    "\n",
    "def check_empty_zone(nm,x,y):\n",
    "    '''\n",
    "    this functions checks if the next after opponent figure cell is empty\n",
    "    - again in the direction of x,y from cell nm\n",
    "    RETURNS: True if condition is met\n",
    "    '''  \n",
    "    if not 1 <= nm[0]+2*x <= N:\n",
    "        return False\n",
    "    if not 1 <= nm[1]+2*y <= M:\n",
    "        return False\n",
    "    \n",
    "    if (nm[0]+2*x,nm[1]+2*y) not in me+him:\n",
    "        return True\n",
    "    else:\n",
    "        return False\n",
    "\n",
    "found = False # we plan to quit as soon as we find first OK to kill - so we trace if any oppo was found\n",
    "\n",
    "for nm in me:\n",
    "    for x,y in [(1,1),(1,-1),(-1,1),(-1,-1)]:                    # checking all four diagonals\n",
    "        if check_kill_zone(nm,x,y) and check_empty_zone(nm,x,y): # checking both must have to kill\n",
    "            print('Yes')\n",
    "            found = True\n",
    "            break\n",
    "    if found:\n",
    "        break\n",
    "\n",
    "if not found:  # to understand if we have found any oppo in the cycle above\n",
    "    print('No')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a01536c9",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
